Revit 2026 API

# RenderingSettingsPrinterResolution Property

---

The resolution level when using printer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PrinterResolution PrinterResolution { get; set; }
```
```vb
Public Property PrinterResolution As PrinterResolution
	Get
	Set
```
```cpp
public:
property PrinterResolution PrinterResolution {
	PrinterResolution get ();
	void set (PrinterResolution value);
}
```
```fsharp
member PrinterResolution : PrinterResolution with get, set
```

#### Property Value

PrinterResolution

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | The resolution target is not printer. |

The suitable resolution value is decided by default. You may obtain it from the ResolutionValue property.

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace